#Область ПроверенныеФункции

#Область ПреобразованиеТипов

// Преобразует исходную строку в число без вызова исключений.
//
// Параметры:
//   Значение - Строка - строка, которую необходимо привести к числу.
//                       Например, "10", "+10", "010", вернет 10;
//                                 "(10)", "-10",вернет -10;
//                                 "10,2", "10.2",вернет 10.2;
//                                 "000", " ", "",вернет 0;
//                                 "10текст", вернет Неопределено.
//
// Возвращаемое значение:
//   Число, Неопределено - полученное число, либо Неопределено, если строка не является числом.
//
Функция СтрокаВЧисло(Знач Значение) Экспорт
	
	Значение  = СтрЗаменить(Значение, " ", "");
	Если СтрНачинаетсяС(Значение, "(") Тогда
		Значение = СтрЗаменить(Значение, "(", "-");
		Значение = СтрЗаменить(Значение, ")", "");
	КонецЕсли;
	
	СтрокаБезНулей = СтрЗаменить(Значение, "0", "");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Результат = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат ?(Результат <> 0 И Не ПустаяСтрока(СтрокаБезНулей), Результат, Неопределено);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ФункцииКПроверкеИОформлению
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки, Параметры) Экспорт
    
    Для Каждого Элм Из Параметры Цикл
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%" + Элм.Ключ,
		    ?(ТипЗнч(Элм.Значение) = Тип("Строка"), Элм.Значение, СокрЛП(Элм.Значение)));
    КонецЦикла;
    
    Возврат СтрокаПодстановки;
    
КонецФункции

Функция ЦифровыеСимволы() Экспорт
    Возврат "0123456789";
КонецФункции // ()

Функция ПустойУИД() Экспорт
    
    Возврат "00000000-0000-0000-0000-000000000000";    
    
КонецФункции // ()

Функция ИнвертироватьСтроку(Знач Строка) Экспорт

    НоваяСтрока = "";
    
    Если Строка <> "" Тогда
        ДлинаСтроки = СтрДлина(Строка);
        
        Для Индекс = 0 По ДлинаСтроки-1 Цикл
        
            НоваяСтрока = НоваяСтрока+Сред(Строка,ДлинаСтроки-Индекс,1)    
        
        КонецЦикла; 
    
    КонецЕсли;
    
    Возврат НоваяСтрока;

КонецФункции // ()

Функция СтрОбрезатьСправа(Знач Строка,ЧислоСимволов) Экспорт
    
    Возврат Лев(Строка,СтрДлина(Строка)-ЧислоСимволов);    

КонецФункции

Функция СтрОбрезатьСлева(Знач Строка, ЧислоСимволов) Экспорт

    Возврат Сред(Строка, ЧислоСимволов + 1);    

КонецФункции

Функция СтрЗаменитьСправа(Знач Строка,ЧислоСимволов,СтрокаЗамены) Экспорт

    Возврат СтрОбрезатьСправа(Строка,ЧислоСимволов)+СтрокаЗамены;            

КонецФункции

Функция СтрЗаменитьСлева(Знач Строка,ЧислоСимволов,СтрокаЗамены) Экспорт

    Возврат СтрокаЗамены+СтрОбрезатьСлева(Строка,ЧислоСимволов);            

КонецФункции

Функция СобратьПредставлениеЗначений(МассивЗначений,Разделитель = " ",ФорматнаяСтрока = "") Экспорт

    МассивСоединения = Новый Массив;
    Форматировать = не ПустаяСтрока(ФорматнаяСтрока);
    
    Если Форматировать Тогда
        ФорматныйТип = Новый ОписаниеТипов("Число,Дата,Булево");    
    Иначе    
        ФорматныйТип = Неопределено;
    КонецЕсли; 
    
    Для каждого ЭлементМассива Из МассивЗначений Цикл
        
        Если Форматировать и ФорматныйТип.СодержитТип(ТипЗнч(ЭлементМассива)) Тогда
            МассивСоединения.Добавить(Формат(ЭлементМассива,ФорматнаяСтрока));
        Иначе    
            МассивСоединения.Добавить(Строка(ЭлементМассива));
        КонецЕсли;
        
    КонецЦикла;
    
    Возврат СтрСоединить(МассивСоединения,Разделитель);

КонецФункции // ()

Процедура ДобавитьСтрокуТекста(Текст,Строка) Экспорт
    
    Если не ПустаяСтрока(Строка) Тогда
        Текст = Текст+?(ПустаяСтрока(Текст),"","
        |")+Строка;
    КонецЕсли;
    
КонецПроцедуры 

Функция СтрУбратьНедопустимыеСимволы(Знач Строка,ДопустимыеСимволы) Экспорт
    НоваяСтрока = "";    
    ЧислоСимволов = СтрДлина(Строка);
    
    Для Индекс = 1 По ЧислоСимволов Цикл
        Символ = Сред(Строка,Индекс,1);
        Если Найти(ДопустимыеСимволы,Символ) > 0 Тогда
            НоваяСтрока = НоваяСтрока+Символ;
        КонецЕсли; 
    КонецЦикла; 
    
    Возврат НоваяСтрока;
КонецФункции // ()

Функция ПолучитьВхожденияПодстроки(Знач Строка,ПодстрокаПоиска) Экспорт
    СтрокаВхождений = Строка;    
    МассивВхождений = Новый Массив;
    ДлинаПодстроки = СтрДлина(ПодстрокаПоиска);
    Обрезано = 0;
    
    Пока Истина Цикл
        Поиск = Найти(СтрокаВхождений,ПодстрокаПоиска);
        
        Если Поиск > 0 Тогда
            МассивВхождений.Добавить(Обрезано+Поиск);
            СтрокаВхождений = СтрОбрезатьСлева(СтрокаВхождений,Поиск+ДлинаПодстроки-1);
            Обрезано = Обрезано+Поиск+ДлинаПодстроки-1;
        Иначе    
            Прервать;
        КонецЕсли; 
        
        Если СтрДлина(СтрокаВхождений) < ДлинаПодстроки Тогда
            Прервать;
        КонецЕсли;
        
    КонецЦикла;
    
    Возврат МассивВхождений;
КонецФункции

Процедура СтрГрупповаяЗамена(Строка,СоответствиеЗамен) Экспорт
    Для каждого ЭлементСоответствия Из СоответствиеЗамен Цикл
        Строка = СтрЗаменить(Строка,ЭлементСоответствия.Ключ,ЭлементСоответствия.Значение);
    КонецЦикла;
КонецПроцедуры

Процедура СтрУбратьПодрядидущиеСимволы(Строка,СтрокаЗамены) Экспорт
    
    Для Индекс = 1 По СтрДлина(СтрокаЗамены) Цикл
        СимволЗамены = Сред(СтрокаЗамены,Индекс,1);
        
        Пока Истина Цикл
            ПодстрокаЗамены = СимволЗамены+СимволЗамены;
            
            Если Найти(Строка,ПодстрокаЗамены) > 0 Тогда
                Строка = СтрЗаменить(Строка,ПодстрокаЗамены,СимволЗамены);
            Иначе    
                Прервать;
            КонецЕсли; 
            
        КонецЦикла;
        
    КонецЦикла; 

КонецПроцедуры

Функция ПолучитьЧислоИзСтроки(Знач Строка,ВернутьЧисло = Ложь) Экспорт
    
    Ошибка = ПустаяСтрока(Строка);
    
    Если Ошибка Тогда
        Возврат ?(ВернутьЧисло,0,Неопределено);
    КонецЕсли; 
    
    ЕстьРазделитель = Ложь;
    Строка = СтрЗаменить(СокрЛП(Строка)," ","");
    Отрицательное = Лев(Строка,1) = "-";
    ЦифровойРяд = ЦифровыеСимволы();
    
    Если Отрицательное Тогда
        Строка = СтрОбрезатьСлева(Строка,1);
    КонецЕсли; 
    
    Для Индекс = 1 По СтрДлина(Строка) Цикл
        Знак = Сред(Строка,Индекс,1);
        
        Если Знак = "," или Знак = "." Тогда
            
            Если ЕстьРазделитель Тогда
                Ошибка = Истина;
                Прервать;
            Иначе
                ЕстьРазделитель = Истина;    
            КонецЕсли;
            
        ИначеЕсли Найти(ЦифровойРяд,Знак) = 0 Тогда
            Ошибка = Истина;
            Прервать;
        КонецЕсли;
        
    КонецЦикла;
    
    Если Отрицательное Тогда
        Строка = "-"+Строка;    
    КонецЕсли; 
    
    Возврат ?(Ошибка,?(ВернутьЧисло,0,Неопределено),Число(Строка));
    
КонецФункции 
#КонецОбласти